[ {
    "id": 1,
    "project_title": "Portfolio - Next.Js ",
    "brief_desc": "You are currently looking at it!",
    "start_date": "Mar 2024",
    "skills": ["TypeScript", "Next.Js", "AWS", "CloudFront"],
    "img_url": "og_Somu%20_%20portfolio.png",
    "project_url": "https://github.com/Somu050600/portfolio",
    "project_website": "https://somu.vercel.app",
    "description": [
      "Developed and launched a professional portfolio website using TypeScript Next.js, harnessing its efficient server-side rendering capabilities to enhance performance and user experience.",
      "Implemented AWS S3 for hosting images, leveraging its scalability and durability to ensure seamless content delivery while maintaining low latency.",
      "Integrated Amazon CloudFront to optimize content delivery, utilizing its global network of edge locations to deliver images and assets to users with improved speed and reduced latency.",
      "Employed best practices in web development and cloud architecture to create a high-performing and visually appealing portfolio platform, demonstrating proficiency in both frontend development and cloud infrastructure management."
    ]
  },
  {
    "id": 2,
    "project_title": "Wallet App - React Native",
    "brief_desc": "Safely store all your cards in a secure digital vault.",
    "start_date": "June 2023",
    "skills": ["React Native", "React Native Paper"],
    "img_url": "wallet_app.webp",
    "project_url": "https://github.com/Somu050600/wallet-app",
    "description": [
      "Created a secure Wallet application using React Native and React Native Paper for theming, prioritizing the storage of sensitive financial information such as credit/debit cards, bank details, and vouchers locally on the device.",
      "Implemented React Native Paper for theming, ensuring a consistent and visually appealing user interface across the application while adhering to Material Design principles for intuitive navigation and interaction.",
      "Utilized Lottie animations to enhance the UI/UX, incorporating dynamic animations throughout the application to provide users with engaging and interactive experiences, from animated splash screens to interactive transitions.",
      "Focused on security measures to safeguard user data, implementing encryption techniques and secure storage mechanisms to protect sensitive information stored within the wallet, thereby ensuring the confidentiality and integrity of user data."
    ]
  },
  {
    "id": 3,
    "project_title": "Listed Dashboard - Frontend",
    "brief_desc": "Crafting React Magic: API whispers data, app dances with charts. One page, boundless insights.",
    "start_date": "Feb. 2023",
    "skills": ["React", "OAuth", "Chart.js"],
    "img_url": "Listed_board.webp",
    "project_url": "https://github.com/Somu050600/listed-assignment",
    "project_website": "https://listed-board.netlify.app/",
    "description": [
      "Developed a front-end web application using with Public APIs serving a APIs with React as the frontend.",
      "Utilized Axios for data retrieval from APIs and integrated Chart.Js to create effective data visualizations.",
      "Ensured mobile responsiveness through the application of responsive design principles and CSS media queries, adapting the single-page application’s layout and components to offer an optimal user experience on various devices with different screen sizes and orientations."
    ]
  },
  {
    "id": 4,
    "project_title": "The VeganHof - Frontend",
    "brief_desc": "Delight your palate while nurturing the planet – VeganHof",
    "start_date": "May 2023",
    "skills": ["React", "OAuth", "JWT", "Django"],
    "img_url": "The_VeganHof.jpeg",
    "project_url": "https://github.com/Somu050600/the-vegan-hof",
    "project_website": "https://the-vegan-hof.netlify.app/",
    "description": [
      "",
      "Developed a secure authentication system utilizing JWT tokens to ensure access to the home page is restricted to authorized users only. Coockies management allows users to remain logged in even after restarting the window.",
      "Integrated Google OAuth login feature, enhancing user experience by providing a convenient login process.",
      "Leveraged RESTful APIs to perform CRUD (create, read, update, delete) operations for efficient data handling."
    ]
  },
  {
    "id": 5,
    "project_title": "Forex Exchange App - Frontend",
    "brief_desc": "A forex exchange app that can converts currencies and shows exchange rates using Public APIs",
    "start_date": "Sept 2023",
    "skills": ["React", "Tailwind CSS", "Public API's"],
    "img_url": "Forex_exchange_app.png",
    "project_url": "https://github.com/Somu050600/forex-exchange-app",
    "project_website": "https://forex-exchange-app.netlify.app/",
    "description": [
      "Developed a responsive frontend application using React.js and Tailwind CSS, providing an intuitive user interface for currency conversion and exchange rate display.",
      "Integrated Public APIs to fetch real-time currency exchange rates, ensuring accurate and up-to-date information for users.",
      "Implemented interactive features allowing users to seamlessly convert currencies with dynamic exchange rate updates, enhancing user engagement and usability.",
      "Leveraged Tailwind CSS utility-first approach to streamline styling and ensure consistent design across the application, resulting in a modern and visually appealing user interface."
    ]
  }
]
